app/Http/Controllers/CourseController.php

select * from `courses` where `name` LIKE '%acb%'
select count(*) as aggregate from `courses` where `name` LIKE '%%'
---
    public function index(Request $request)
    {
        $search = $request->get('q');
        $courses = Course::query()
                ->where('name', 'LIKE', '%'.$search.'%')
                ->paginate(3);

insert into `courses` (`name`, `updated_at`, `created_at`) values ('1234', '2022-05-02 13:00:22', '2022-05-02 13:00:22')
---
    public function store(StoreCourseRequest $request)
    {
        $object = new Course();
        // $object->fill($request->except('_token')); // column khớp column database
        $object->fill($request->validated()); // column khớp column database
        $object->save();

update `courses` set `name` = 'Lap trinh 123', `courses`.`updated_at` = '2022-05-02 07:46:07' where `id` = 1
---
    public function update(UpdateCourseRequest $request, Course $course)
    {
        // c1
        // Course::where('id', $course->id)->update(
        //     $request->except([
        //         '_token',
        //         '_method'
        //     ])
        // );

        // c2
        $course->update(
            $request->except([
                '_token',
                '_method'
            ])
        );