app/Http/Controllers/CourseController.php

    public function index()
    {
        $courses = Course::all();
---
select * from `courses`